; ModuleID = '/home/klee/dockermount/checksum-repair/samples/ini/ini.c'
source_filename = "/home/klee/dockermount/checksum-repair/samples/ini/ini.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ini_parse_string_ctx = type { i8*, i64 }
%struct.configuration = type { i32 }

@.str = private unnamed_addr constant [3 x i8] c";#\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"]\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"=:\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [2 x i8] c";\00", align 1

; Function Attrs: noinline nounwind uwtable
define i32 @ini_parse_stream(i8* (i8*, i32, i8*)* %reader, i8* %stream, i32 (i8*, i8*, i8*, i8*)* %handler, i8* %user) #0 !dbg !44 {
  %reader.addr = alloca i8* (i8*, i32, i8*)*, align 8
  %stream.addr = alloca i8*, align 8
  %handler.addr = alloca i32 (i8*, i8*, i8*, i8*)*, align 8
  %user.addr = alloca i8*, align 8
  %line = alloca [200 x i8], align 16
  %max_line = alloca i32, align 4
  %section = alloca [50 x i8], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.1 (tags/RELEASE_401/final 336792)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18)
!1 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/ini/ini.c", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !21, !28, !29, !26, !30}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ini_reader", file: !22, line: 36, baseType: !23)
!22 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/ini/ini.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !26, !28, !19}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ini_parse_string_ctx", file: !1, line: 32, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 29, size: 128, elements: !33)
!33 = !{!34, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !32, file: !1, line: 30, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "num_left", scope: !32, file: !1, line: 31, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 62, baseType: !40)
!39 = !DIFile(filename: "/home/klee/toolchains/llvm+clang-401-x86_64-unknown-linux-gnu/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{!"clang version 4.0.1 (tags/RELEASE_401/final 336792)"}
!44 = distinct !DISubprogram(name: "ini_parse_stream", scope: !1, file: !1, line: 80, type: !45, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!45 = !DISubroutineType(types: !46)
!46 = !{!28, !21, !19, !47, !19}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ini_handler", file: !22, line: 31, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!28, !19, !35, !35, !35}
!51 = !{}
!52 = !DILocalVariable(name: "reader", arg: 1, scope: !44, file: !1, line: 80, type: !21)
!53 = !DIExpression()
!54 = !DILocation(line: 80, column: 33, scope: !44)
!55 = !DILocalVariable(name: "stream", arg: 2, scope: !44, file: !1, line: 80, type: !19)
!56 = !DILocation(line: 80, column: 47, scope: !44)
!57 = !DILocalVariable(name: "handler", arg: 3, scope: !44, file: !1, line: 80, type: !47)
!58 = !DILocation(line: 80, column: 67, scope: !44)
!59 = !DILocalVariable(name: "user", arg: 4, scope: !44, file: !1, line: 81, type: !19)
!60 = !DILocation(line: 81, column: 28, scope: !44)
!61 = !DILocalVariable(name: "line", scope: !44, file: !1, line: 85, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 200)
!65 = !DILocation(line: 85, column: 10, scope: !44)
!66 = !DILocalVariable(name: "max_line", scope: !44, file: !1, line: 86, type: !28)
!67 = !DILocation(line: 86, column: 9, scope: !44)
!68 = !DILocalVariable(name: "section", scope: !44, file: !1, line: 95, type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 50)
!72 = !DILocation(line: 95, column: 10, scope: !44)
!73 = !DILocalVariable(name: "prev_name", scope: !44, file: !1, line: 96, type: !69)
!74 = !DILocation(line: 96, column: 10, scope: !44)
!75 = !DILocalVariable(name: "start", scope: !44, file: !1, line: 98, type: !26)
!76 = !DILocation(line: 98, column: 11, scope: !44)
!77 = !DILocalVariable(name: "end", scope: !44, file: !1, line: 99, type: !26)
!78 = !DILocation(line: 99, column: 11, scope: !44)
!79 = !DILocalVariable(name: "name", scope: !44, file: !1, line: 100, type: !26)
!80 = !DILocation(line: 100, column: 11, scope: !44)
!81 = !DILocalVariable(name: "value", scope: !44, file: !1, line: 101, type: !26)
!82 = !DILocation(line: 101, column: 11, scope: !44)
!83 = !DILocalVariable(name: "lineno", scope: !44, file: !1, line: 102, type: !28)
!84 = !DILocation(line: 102, column: 9, scope: !44)
!85 = !DILocalVariable(name: "error", scope: !44, file: !1, line: 103, type: !28)
!86 = !DILocation(line: 103, column: 9, scope: !44)
!87 = !DILocation(line: 119, column: 5, scope: !44)
!88 = !DILocation(line: 119, column: 12, scope: !89)
!89 = !DILexicalBlockFile(scope: !44, file: !1, discriminator: 1)
!90 = !DILocation(line: 119, column: 19, scope: !89)
!91 = !DILocation(line: 119, column: 25, scope: !89)
!92 = !DILocation(line: 119, column: 35, scope: !89)
!93 = !DILocation(line: 119, column: 43, scope: !89)
!94 = !DILocation(line: 119, column: 5, scope: !89)
!95 = !DILocation(line: 140, column: 15, scope: !96)
!96 = distinct !DILexicalBlock(scope: !44, file: !1, line: 119, column: 52)
!97 = !DILocation(line: 142, column: 17, scope: !96)
!98 = !DILocation(line: 142, column: 15, scope: !96)
!99 = !DILocation(line: 144, column: 13, scope: !100)
!100 = distinct !DILexicalBlock(scope: !96, file: !1, line: 144, column: 13)
!101 = !DILocation(line: 144, column: 20, scope: !100)
!102 = !DILocation(line: 144, column: 25, scope: !100)
!103 = !DILocation(line: 144, column: 43, scope: !104)
!104 = !DILexicalBlockFile(scope: !100, file: !1, discriminator: 1)
!105 = !DILocation(line: 144, column: 28, scope: !104)
!106 = !DILocation(line: 144, column: 52, scope: !104)
!107 = !DILocation(line: 144, column: 60, scope: !104)
!108 = !DILocation(line: 145, column: 43, scope: !100)
!109 = !DILocation(line: 145, column: 28, scope: !100)
!110 = !DILocation(line: 145, column: 52, scope: !100)
!111 = !DILocation(line: 145, column: 60, scope: !100)
!112 = !DILocation(line: 146, column: 43, scope: !100)
!113 = !DILocation(line: 146, column: 28, scope: !100)
!114 = !DILocation(line: 146, column: 52, scope: !100)
!115 = !DILocation(line: 144, column: 13, scope: !116)
!116 = !DILexicalBlockFile(scope: !96, file: !1, discriminator: 2)
!117 = !DILocation(line: 147, column: 19, scope: !118)
!118 = distinct !DILexicalBlock(scope: !100, file: !1, line: 146, column: 61)
!119 = !DILocation(line: 148, column: 9, scope: !118)
!120 = !DILocation(line: 150, column: 30, scope: !96)
!121 = !DILocation(line: 150, column: 23, scope: !96)
!122 = !DILocation(line: 150, column: 17, scope: !123)
!123 = !DILexicalBlockFile(scope: !96, file: !1, discriminator: 1)
!124 = !DILocation(line: 150, column: 15, scope: !96)
!125 = !DILocation(line: 152, column: 49, scope: !126)
!126 = distinct !DILexicalBlock(scope: !96, file: !1, line: 152, column: 13)
!127 = !DILocation(line: 152, column: 48, scope: !126)
!128 = !DILocation(line: 152, column: 13, scope: !126)
!129 = !DILocation(line: 152, column: 13, scope: !96)
!130 = !DILocation(line: 154, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !126, file: !1, line: 152, column: 57)
!132 = !DILocation(line: 156, column: 18, scope: !133)
!133 = distinct !DILexicalBlock(scope: !126, file: !1, line: 156, column: 18)
!134 = !DILocation(line: 156, column: 29, scope: !133)
!135 = !DILocation(line: 156, column: 33, scope: !136)
!136 = !DILexicalBlockFile(scope: !133, file: !1, discriminator: 1)
!137 = !DILocation(line: 156, column: 32, scope: !136)
!138 = !DILocation(line: 156, column: 39, scope: !136)
!139 = !DILocation(line: 156, column: 42, scope: !140)
!140 = !DILexicalBlockFile(scope: !133, file: !1, discriminator: 2)
!141 = !DILocation(line: 156, column: 50, scope: !140)
!142 = !DILocation(line: 156, column: 48, scope: !140)
!143 = !DILocation(line: 156, column: 18, scope: !144)
!144 = !DILexicalBlockFile(scope: !126, file: !1, discriminator: 2)
!145 = !DILocation(line: 159, column: 18, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !1, line: 159, column: 17)
!147 = distinct !DILexicalBlock(scope: !133, file: !1, line: 156, column: 56)
!148 = !DILocation(line: 159, column: 59, scope: !146)
!149 = !DILocation(line: 159, column: 63, scope: !150)
!150 = !DILexicalBlockFile(scope: !146, file: !1, discriminator: 1)
!151 = !DILocation(line: 159, column: 17, scope: !152)
!152 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 1)
!153 = !DILocation(line: 160, column: 25, scope: !146)
!154 = !DILocation(line: 160, column: 23, scope: !146)
!155 = !DILocation(line: 160, column: 17, scope: !146)
!156 = !DILocation(line: 161, column: 9, scope: !147)
!157 = !DILocation(line: 163, column: 19, scope: !158)
!158 = distinct !DILexicalBlock(scope: !133, file: !1, line: 163, column: 18)
!159 = !DILocation(line: 163, column: 18, scope: !158)
!160 = !DILocation(line: 163, column: 25, scope: !158)
!161 = !DILocation(line: 163, column: 18, scope: !133)
!162 = !DILocation(line: 165, column: 41, scope: !163)
!163 = distinct !DILexicalBlock(scope: !158, file: !1, line: 163, column: 33)
!164 = !DILocation(line: 165, column: 47, scope: !163)
!165 = !DILocation(line: 165, column: 19, scope: !163)
!166 = !DILocation(line: 165, column: 17, scope: !163)
!167 = !DILocation(line: 166, column: 18, scope: !168)
!168 = distinct !DILexicalBlock(scope: !163, file: !1, line: 166, column: 17)
!169 = !DILocation(line: 166, column: 17, scope: !168)
!170 = !DILocation(line: 166, column: 22, scope: !168)
!171 = !DILocation(line: 166, column: 17, scope: !163)
!172 = !DILocation(line: 167, column: 18, scope: !173)
!173 = distinct !DILexicalBlock(scope: !168, file: !1, line: 166, column: 30)
!174 = !DILocation(line: 167, column: 22, scope: !173)
!175 = !DILocation(line: 168, column: 26, scope: !173)
!176 = !DILocation(line: 168, column: 35, scope: !173)
!177 = !DILocation(line: 168, column: 41, scope: !173)
!178 = !DILocation(line: 168, column: 17, scope: !173)
!179 = !DILocation(line: 169, column: 17, scope: !173)
!180 = !DILocation(line: 169, column: 28, scope: !173)
!181 = !DILocation(line: 170, column: 13, scope: !173)
!182 = !DILocation(line: 171, column: 23, scope: !183)
!183 = distinct !DILexicalBlock(scope: !168, file: !1, line: 171, column: 22)
!184 = !DILocation(line: 171, column: 22, scope: !168)
!185 = !DILocation(line: 173, column: 25, scope: !186)
!186 = distinct !DILexicalBlock(scope: !183, file: !1, line: 171, column: 30)
!187 = !DILocation(line: 173, column: 23, scope: !186)
!188 = !DILocation(line: 174, column: 13, scope: !186)
!189 = !DILocation(line: 175, column: 9, scope: !163)
!190 = !DILocation(line: 176, column: 19, scope: !191)
!191 = distinct !DILexicalBlock(scope: !158, file: !1, line: 176, column: 18)
!192 = !DILocation(line: 176, column: 18, scope: !191)
!193 = !DILocation(line: 176, column: 18, scope: !158)
!194 = !DILocation(line: 178, column: 41, scope: !195)
!195 = distinct !DILexicalBlock(scope: !191, file: !1, line: 176, column: 26)
!196 = !DILocation(line: 178, column: 19, scope: !195)
!197 = !DILocation(line: 178, column: 17, scope: !195)
!198 = !DILocation(line: 179, column: 18, scope: !199)
!199 = distinct !DILexicalBlock(scope: !195, file: !1, line: 179, column: 17)
!200 = !DILocation(line: 179, column: 17, scope: !199)
!201 = !DILocation(line: 179, column: 22, scope: !199)
!202 = !DILocation(line: 179, column: 29, scope: !199)
!203 = !DILocation(line: 179, column: 33, scope: !204)
!204 = !DILexicalBlockFile(scope: !199, file: !1, discriminator: 1)
!205 = !DILocation(line: 179, column: 32, scope: !204)
!206 = !DILocation(line: 179, column: 37, scope: !204)
!207 = !DILocation(line: 179, column: 17, scope: !208)
!208 = !DILexicalBlockFile(scope: !195, file: !1, discriminator: 1)
!209 = !DILocation(line: 180, column: 18, scope: !210)
!210 = distinct !DILexicalBlock(scope: !199, file: !1, line: 179, column: 45)
!211 = !DILocation(line: 180, column: 22, scope: !210)
!212 = !DILocation(line: 181, column: 31, scope: !210)
!213 = !DILocation(line: 181, column: 24, scope: !210)
!214 = !DILocation(line: 181, column: 22, scope: !210)
!215 = !DILocation(line: 182, column: 25, scope: !210)
!216 = !DILocation(line: 182, column: 29, scope: !210)
!217 = !DILocation(line: 182, column: 23, scope: !210)
!218 = !DILocation(line: 184, column: 45, scope: !210)
!219 = !DILocation(line: 184, column: 23, scope: !210)
!220 = !DILocation(line: 184, column: 21, scope: !210)
!221 = !DILocation(line: 185, column: 22, scope: !222)
!222 = distinct !DILexicalBlock(scope: !210, file: !1, line: 185, column: 21)
!223 = !DILocation(line: 185, column: 21, scope: !222)
!224 = !DILocation(line: 185, column: 21, scope: !210)
!225 = !DILocation(line: 186, column: 22, scope: !222)
!226 = !DILocation(line: 186, column: 26, scope: !222)
!227 = !DILocation(line: 186, column: 21, scope: !222)
!228 = !DILocation(line: 188, column: 31, scope: !210)
!229 = !DILocation(line: 188, column: 25, scope: !210)
!230 = !DILocation(line: 188, column: 23, scope: !210)
!231 = !DILocation(line: 189, column: 24, scope: !210)
!232 = !DILocation(line: 189, column: 17, scope: !210)
!233 = !DILocation(line: 192, column: 26, scope: !210)
!234 = !DILocation(line: 192, column: 37, scope: !210)
!235 = !DILocation(line: 192, column: 17, scope: !210)
!236 = !DILocation(line: 193, column: 22, scope: !237)
!237 = distinct !DILexicalBlock(scope: !210, file: !1, line: 193, column: 21)
!238 = !DILocation(line: 193, column: 58, scope: !237)
!239 = !DILocation(line: 193, column: 62, scope: !240)
!240 = !DILexicalBlockFile(scope: !237, file: !1, discriminator: 1)
!241 = !DILocation(line: 193, column: 21, scope: !242)
!242 = !DILexicalBlockFile(scope: !210, file: !1, discriminator: 1)
!243 = !DILocation(line: 194, column: 29, scope: !237)
!244 = !DILocation(line: 194, column: 27, scope: !237)
!245 = !DILocation(line: 194, column: 21, scope: !237)
!246 = !DILocation(line: 195, column: 13, scope: !210)
!247 = !DILocation(line: 196, column: 23, scope: !248)
!248 = distinct !DILexicalBlock(scope: !199, file: !1, line: 196, column: 22)
!249 = !DILocation(line: 196, column: 22, scope: !199)
!250 = !DILocation(line: 198, column: 25, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 196, column: 30)
!252 = !DILocation(line: 198, column: 23, scope: !251)
!253 = !DILocation(line: 199, column: 13, scope: !251)
!254 = !DILocation(line: 200, column: 9, scope: !195)
!255 = !DILocation(line: 203, column: 13, scope: !256)
!256 = distinct !DILexicalBlock(scope: !96, file: !1, line: 203, column: 13)
!257 = !DILocation(line: 203, column: 13, scope: !96)
!258 = !DILocation(line: 204, column: 13, scope: !256)
!259 = !DILocation(line: 119, column: 5, scope: !260)
!260 = !DILexicalBlockFile(scope: !44, file: !1, discriminator: 2)
!261 = distinct !{!261, !87, !262}
!262 = !DILocation(line: 206, column: 5, scope: !44)
!263 = !DILocation(line: 212, column: 12, scope: !44)
!264 = !DILocation(line: 212, column: 5, scope: !44)
!265 = distinct !DISubprogram(name: "lskip", scope: !1, file: !1, line: 44, type: !266, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!266 = !DISubroutineType(types: !267)
!267 = !{!26, !35}
!268 = !DILocalVariable(name: "s", arg: 1, scope: !265, file: !1, line: 44, type: !35)
!269 = !DILocation(line: 44, column: 32, scope: !265)
!270 = !DILocation(line: 46, column: 5, scope: !265)
!271 = !DILocation(line: 46, column: 13, scope: !272)
!272 = !DILexicalBlockFile(scope: !265, file: !1, discriminator: 1)
!273 = !DILocation(line: 46, column: 12, scope: !272)
!274 = !DILocation(line: 46, column: 15, scope: !272)
!275 = !DILocation(line: 46, column: 18, scope: !276)
!276 = !DILexicalBlockFile(scope: !265, file: !1, discriminator: 2)
!277 = !DILocation(line: 46, column: 15, scope: !276)
!278 = !DILocation(line: 46, column: 5, scope: !279)
!279 = !DILexicalBlockFile(scope: !265, file: !1, discriminator: 3)
!280 = !DILocation(line: 47, column: 10, scope: !265)
!281 = !DILocation(line: 46, column: 5, scope: !282)
!282 = !DILexicalBlockFile(scope: !265, file: !1, discriminator: 4)
!283 = distinct !{!283, !270, !280}
!284 = !DILocation(line: 48, column: 19, scope: !265)
!285 = !DILocation(line: 48, column: 5, scope: !265)
!286 = distinct !DISubprogram(name: "rstrip", scope: !1, file: !1, line: 35, type: !287, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!287 = !DISubroutineType(types: !288)
!288 = !{!26, !26}
!289 = !DILocalVariable(name: "s", arg: 1, scope: !286, file: !1, line: 35, type: !26)
!290 = !DILocation(line: 35, column: 27, scope: !286)
!291 = !DILocalVariable(name: "p", scope: !286, file: !1, line: 37, type: !26)
!292 = !DILocation(line: 37, column: 11, scope: !286)
!293 = !DILocation(line: 37, column: 15, scope: !286)
!294 = !DILocation(line: 37, column: 26, scope: !286)
!295 = !DILocation(line: 37, column: 19, scope: !286)
!296 = !DILocation(line: 37, column: 17, scope: !286)
!297 = !DILocation(line: 38, column: 5, scope: !286)
!298 = !DILocation(line: 38, column: 12, scope: !299)
!299 = !DILexicalBlockFile(scope: !286, file: !1, discriminator: 1)
!300 = !DILocation(line: 38, column: 16, scope: !299)
!301 = !DILocation(line: 38, column: 14, scope: !299)
!302 = !DILocation(line: 38, column: 18, scope: !299)
!303 = !DILocation(line: 38, column: 21, scope: !304)
!304 = !DILexicalBlockFile(scope: !286, file: !1, discriminator: 2)
!305 = !DILocation(line: 38, column: 18, scope: !304)
!306 = !DILocation(line: 38, column: 5, scope: !307)
!307 = !DILexicalBlockFile(scope: !286, file: !1, discriminator: 3)
!308 = !DILocation(line: 39, column: 10, scope: !286)
!309 = !DILocation(line: 39, column: 12, scope: !286)
!310 = !DILocation(line: 38, column: 5, scope: !311)
!311 = !DILexicalBlockFile(scope: !286, file: !1, discriminator: 4)
!312 = distinct !{!312, !297, !313}
!313 = !DILocation(line: 39, column: 14, scope: !286)
!314 = !DILocation(line: 40, column: 12, scope: !286)
!315 = !DILocation(line: 40, column: 5, scope: !286)
!316 = distinct !DISubprogram(name: "find_chars_or_comment", scope: !1, file: !1, line: 54, type: !317, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!317 = !DISubroutineType(types: !318)
!318 = !{!26, !35, !35}
!319 = !DILocalVariable(name: "s", arg: 1, scope: !316, file: !1, line: 54, type: !35)
!320 = !DILocation(line: 54, column: 48, scope: !316)
!321 = !DILocalVariable(name: "chars", arg: 2, scope: !316, file: !1, line: 54, type: !35)
!322 = !DILocation(line: 54, column: 63, scope: !316)
!323 = !DILocalVariable(name: "was_space", scope: !316, file: !1, line: 57, type: !28)
!324 = !DILocation(line: 57, column: 9, scope: !316)
!325 = !DILocation(line: 58, column: 5, scope: !316)
!326 = !DILocation(line: 58, column: 13, scope: !327)
!327 = !DILexicalBlockFile(scope: !316, file: !1, discriminator: 1)
!328 = !DILocation(line: 58, column: 12, scope: !327)
!329 = !DILocation(line: 58, column: 15, scope: !327)
!330 = !DILocation(line: 58, column: 20, scope: !331)
!331 = !DILexicalBlockFile(scope: !316, file: !1, discriminator: 2)
!332 = !DILocation(line: 58, column: 26, scope: !331)
!333 = !DILocation(line: 58, column: 37, scope: !334)
!334 = !DILexicalBlockFile(scope: !316, file: !1, discriminator: 3)
!335 = !DILocation(line: 58, column: 45, scope: !334)
!336 = !DILocation(line: 58, column: 44, scope: !334)
!337 = !DILocation(line: 58, column: 30, scope: !334)
!338 = !DILocation(line: 58, column: 49, scope: !334)
!339 = !DILocation(line: 59, column: 14, scope: !316)
!340 = !DILocation(line: 59, column: 24, scope: !316)
!341 = !DILocation(line: 59, column: 64, scope: !327)
!342 = !DILocation(line: 59, column: 63, scope: !327)
!343 = !DILocation(line: 59, column: 27, scope: !327)
!344 = !DILocation(line: 59, column: 24, scope: !327)
!345 = !DILocation(line: 59, column: 12, scope: !331)
!346 = !DILocation(line: 58, column: 5, scope: !347)
!347 = !DILexicalBlockFile(scope: !316, file: !1, discriminator: 4)
!348 = !DILocation(line: 60, column: 21, scope: !349)
!349 = distinct !DILexicalBlock(scope: !316, file: !1, line: 59, column: 69)
!350 = !DILocation(line: 60, column: 19, scope: !349)
!351 = !DILocation(line: 61, column: 10, scope: !349)
!352 = !DILocation(line: 58, column: 5, scope: !353)
!353 = !DILexicalBlockFile(scope: !316, file: !1, discriminator: 5)
!354 = distinct !{!354, !325, !355}
!355 = !DILocation(line: 62, column: 5, scope: !316)
!356 = !DILocation(line: 68, column: 19, scope: !316)
!357 = !DILocation(line: 68, column: 5, scope: !316)
!358 = distinct !DISubprogram(name: "strncpy0", scope: !1, file: !1, line: 72, type: !359, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!359 = !DISubroutineType(types: !360)
!360 = !{!26, !26, !35, !38}
!361 = !DILocalVariable(name: "dest", arg: 1, scope: !358, file: !1, line: 72, type: !26)
!362 = !DILocation(line: 72, column: 29, scope: !358)
!363 = !DILocalVariable(name: "src", arg: 2, scope: !358, file: !1, line: 72, type: !35)
!364 = !DILocation(line: 72, column: 47, scope: !358)
!365 = !DILocalVariable(name: "size", arg: 3, scope: !358, file: !1, line: 72, type: !38)
!366 = !DILocation(line: 72, column: 59, scope: !358)
!367 = !DILocation(line: 74, column: 13, scope: !358)
!368 = !DILocation(line: 74, column: 19, scope: !358)
!369 = !DILocation(line: 74, column: 24, scope: !358)
!370 = !DILocation(line: 74, column: 29, scope: !358)
!371 = !DILocation(line: 74, column: 5, scope: !358)
!372 = !DILocation(line: 75, column: 5, scope: !358)
!373 = !DILocation(line: 75, column: 10, scope: !358)
!374 = !DILocation(line: 75, column: 15, scope: !358)
!375 = !DILocation(line: 75, column: 20, scope: !358)
!376 = !DILocation(line: 76, column: 12, scope: !358)
!377 = !DILocation(line: 76, column: 5, scope: !358)
!378 = distinct !DISubprogram(name: "ini_parse_file", scope: !1, file: !1, line: 216, type: !379, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!379 = !DISubroutineType(types: !380)
!380 = !{!28, !381, !47, !19}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !383, line: 48, baseType: !384)
!383 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !385, line: 245, size: 1728, elements: !386)
!385 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !407, !408, !409, !410, !414, !415, !417, !421, !424, !426, !427, !428, !429, !430, !431, !432}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !384, file: !385, line: 246, baseType: !28, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !384, file: !385, line: 251, baseType: !26, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !384, file: !385, line: 252, baseType: !26, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !384, file: !385, line: 253, baseType: !26, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !384, file: !385, line: 254, baseType: !26, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !384, file: !385, line: 255, baseType: !26, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !384, file: !385, line: 256, baseType: !26, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !384, file: !385, line: 257, baseType: !26, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !384, file: !385, line: 258, baseType: !26, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !384, file: !385, line: 260, baseType: !26, size: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !384, file: !385, line: 261, baseType: !26, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !384, file: !385, line: 262, baseType: !26, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !384, file: !385, line: 264, baseType: !400, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !385, line: 160, size: 192, elements: !402)
!402 = !{!403, !404, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !401, file: !385, line: 161, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !401, file: !385, line: 162, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !401, file: !385, line: 166, baseType: !28, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !384, file: !385, line: 266, baseType: !405, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !384, file: !385, line: 268, baseType: !28, size: 32, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !384, file: !385, line: 272, baseType: !28, size: 32, offset: 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !384, file: !385, line: 274, baseType: !411, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !412, line: 131, baseType: !413)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/klee/dockermount/checksum-repair/samples/ini")
!413 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !384, file: !385, line: 278, baseType: !29, size: 16, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !384, file: !385, line: 279, baseType: !416, size: 8, offset: 1040)
!416 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !384, file: !385, line: 280, baseType: !418, size: 8, offset: 1048)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !384, file: !385, line: 284, baseType: !422, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !385, line: 154, baseType: null)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !384, file: !385, line: 293, baseType: !425, size: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !412, line: 132, baseType: !413)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !384, file: !385, line: 302, baseType: !19, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !384, file: !385, line: 303, baseType: !19, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !384, file: !385, line: 304, baseType: !19, size: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !384, file: !385, line: 305, baseType: !19, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !384, file: !385, line: 306, baseType: !38, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !384, file: !385, line: 308, baseType: !28, size: 32, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !384, file: !385, line: 310, baseType: !433, size: 160, offset: 1568)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 20)
!436 = !DILocalVariable(name: "file", arg: 1, scope: !378, file: !1, line: 216, type: !381)
!437 = !DILocation(line: 216, column: 26, scope: !378)
!438 = !DILocalVariable(name: "handler", arg: 2, scope: !378, file: !1, line: 216, type: !47)
!439 = !DILocation(line: 216, column: 44, scope: !378)
!440 = !DILocalVariable(name: "user", arg: 3, scope: !378, file: !1, line: 216, type: !19)
!441 = !DILocation(line: 216, column: 59, scope: !378)
!442 = !DILocation(line: 218, column: 48, scope: !378)
!443 = !DILocation(line: 218, column: 54, scope: !378)
!444 = !DILocation(line: 218, column: 63, scope: !378)
!445 = !DILocation(line: 218, column: 12, scope: !378)
!446 = !DILocation(line: 218, column: 5, scope: !378)
!447 = distinct !DISubprogram(name: "ini_parse", scope: !1, file: !1, line: 222, type: !448, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!448 = !DISubroutineType(types: !449)
!449 = !{!28, !35, !47, !19}
!450 = !DILocalVariable(name: "filename", arg: 1, scope: !447, file: !1, line: 222, type: !35)
!451 = !DILocation(line: 222, column: 27, scope: !447)
!452 = !DILocalVariable(name: "handler", arg: 2, scope: !447, file: !1, line: 222, type: !47)
!453 = !DILocation(line: 222, column: 49, scope: !447)
!454 = !DILocalVariable(name: "user", arg: 3, scope: !447, file: !1, line: 222, type: !19)
!455 = !DILocation(line: 222, column: 64, scope: !447)
!456 = !DILocalVariable(name: "file", scope: !447, file: !1, line: 224, type: !381)
!457 = !DILocation(line: 224, column: 11, scope: !447)
!458 = !DILocalVariable(name: "error", scope: !447, file: !1, line: 225, type: !28)
!459 = !DILocation(line: 225, column: 9, scope: !447)
!460 = !DILocation(line: 227, column: 18, scope: !447)
!461 = !DILocation(line: 227, column: 12, scope: !447)
!462 = !DILocation(line: 227, column: 10, scope: !447)
!463 = !DILocation(line: 228, column: 10, scope: !464)
!464 = distinct !DILexicalBlock(scope: !447, file: !1, line: 228, column: 9)
!465 = !DILocation(line: 228, column: 9, scope: !447)
!466 = !DILocation(line: 229, column: 9, scope: !464)
!467 = !DILocation(line: 230, column: 28, scope: !447)
!468 = !DILocation(line: 230, column: 34, scope: !447)
!469 = !DILocation(line: 230, column: 43, scope: !447)
!470 = !DILocation(line: 230, column: 13, scope: !447)
!471 = !DILocation(line: 230, column: 11, scope: !447)
!472 = !DILocation(line: 231, column: 12, scope: !447)
!473 = !DILocation(line: 231, column: 5, scope: !447)
!474 = !DILocation(line: 232, column: 12, scope: !447)
!475 = !DILocation(line: 232, column: 5, scope: !447)
!476 = !DILocation(line: 233, column: 1, scope: !447)
!477 = distinct !DISubprogram(name: "ini_parse_string", scope: !1, file: !1, line: 263, type: !448, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!478 = !DILocalVariable(name: "string", arg: 1, scope: !477, file: !1, line: 263, type: !35)
!479 = !DILocation(line: 263, column: 34, scope: !477)
!480 = !DILocalVariable(name: "handler", arg: 2, scope: !477, file: !1, line: 263, type: !47)
!481 = !DILocation(line: 263, column: 54, scope: !477)
!482 = !DILocalVariable(name: "user", arg: 3, scope: !477, file: !1, line: 263, type: !19)
!483 = !DILocation(line: 263, column: 69, scope: !477)
!484 = !DILocalVariable(name: "ctx", scope: !477, file: !1, line: 264, type: !31)
!485 = !DILocation(line: 264, column: 26, scope: !477)
!486 = !DILocation(line: 266, column: 15, scope: !477)
!487 = !DILocation(line: 266, column: 9, scope: !477)
!488 = !DILocation(line: 266, column: 13, scope: !477)
!489 = !DILocation(line: 267, column: 27, scope: !477)
!490 = !DILocation(line: 267, column: 20, scope: !477)
