; ModuleID = '/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c.uninstrumented.bc'
source_filename = "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.CsvParser = type { i8*, i8, i32, i8*, %struct.CsvRow*, %struct._IO_FILE*, i32, i8*, i32 }
%struct.CsvRow = type { i8**, i32 }

@.str = private unnamed_addr constant [74 x i8] c"Cannot supply header, as current CsvParser object does not support header\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Supplied CSV file path is NULL\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"Supplied CSV string is NULL\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"Supplied delimiter is not supported\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.6 = private unnamed_addr constant [44 x i8] c"Error opening CSV file for reading: %s : %s\00", align 1
@.str.7 = private unnamed_addr constant [12 x i8] c"Reached EOF\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.1 (tags/RELEASE_401/final 336792)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!2 = !{}
!3 = !{!4, !72, !10, !17, !22}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "CsvParser", file: !6, line: 25, baseType: !7)
!6 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CsvParser", file: !6, line: 15, size: 512, elements: !8)
!8 = !{!9, !12, !13, !15, !16, !24, !85, !86, !87}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "filePath_", scope: !7, file: !6, line: 16, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter_", scope: !7, file: !6, line: 17, baseType: !11, size: 8, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "firstLineIsHeader_", scope: !7, file: !6, line: 18, baseType: !14, size: 32, offset: 96)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "errMsg_", scope: !7, file: !6, line: 19, baseType: !10, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "header_", scope: !7, file: !6, line: 20, baseType: !17, size: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "CsvRow", file: !6, line: 13, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", file: !6, line: 10, size: 128, elements: !20)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fields_", scope: !19, file: !6, line: 11, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "numOfFields_", scope: !19, file: !6, line: 12, baseType: !14, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "fileHandler_", scope: !7, file: !6, line: 21, baseType: !25, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 48, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 245, size: 1728, elements: !30)
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !51, !52, !53, !54, !58, !60, !62, !66, !69, !71, !73, !74, !75, !76, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 246, baseType: !14, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 251, baseType: !10, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 252, baseType: !10, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 253, baseType: !10, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 254, baseType: !10, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 255, baseType: !10, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 256, baseType: !10, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 257, baseType: !10, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 258, baseType: !10, size: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 260, baseType: !10, size: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 261, baseType: !10, size: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 262, baseType: !10, size: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 264, baseType: !44, size: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 160, size: 192, elements: !46)
!46 = !{!47, !48, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !45, file: !29, line: 161, baseType: !44, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !45, file: !29, line: 162, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !45, file: !29, line: 166, baseType: !14, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 266, baseType: !49, size: 64, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 268, baseType: !14, size: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 272, baseType: !14, size: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 274, baseType: !55, size: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 131, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 278, baseType: !59, size: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 279, baseType: !61, size: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 280, baseType: !63, size: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 284, baseType: !67, size: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 154, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 293, baseType: !70, size: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 132, baseType: !57)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !28, file: !29, line: 302, baseType: !72, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !28, file: !29, line: 303, baseType: !72, size: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !28, file: !29, line: 304, baseType: !72, size: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !28, file: !29, line: 305, baseType: !72, size: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 306, baseType: !77, size: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 62, baseType: !79)
!78 = !DIFile(filename: "/home/klee/toolchains/llvm+clang-401-x86_64-unknown-linux-gnu/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 308, baseType: !14, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 310, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fromString_", scope: !7, file: !6, line: 22, baseType: !14, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "csvString_", scope: !7, file: !6, line: 23, baseType: !10, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "csvStringIter_", scope: !7, file: !6, line: 24, baseType: !14, size: 32, offset: 448)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"clang version 4.0.1 (tags/RELEASE_401/final 336792)"}
!91 = distinct !DISubprogram(name: "CsvParser_new", scope: !1, file: !1, line: 12, type: !92, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!92 = !DISubroutineType(types: !93)
!93 = !{!4, !94, !94, !14}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!96 = !DILocalVariable(name: "filePath", arg: 1, scope: !91, file: !1, line: 12, type: !94)
!97 = !DIExpression()
!98 = !DILocation(line: 12, column: 38, scope: !91)
!99 = !DILocalVariable(name: "delimiter", arg: 2, scope: !91, file: !1, line: 12, type: !94)
!100 = !DILocation(line: 12, column: 60, scope: !91)
!101 = !DILocalVariable(name: "firstLineIsHeader", arg: 3, scope: !91, file: !1, line: 12, type: !14)
!102 = !DILocation(line: 12, column: 75, scope: !91)
!103 = !DILocalVariable(name: "csvParser", scope: !91, file: !1, line: 13, type: !4)
!104 = !DILocation(line: 13, column: 16, scope: !91)
!105 = !DILocation(line: 13, column: 40, scope: !91)
!106 = !DILocation(line: 13, column: 28, scope: !91)
!107 = !DILocation(line: 14, column: 9, scope: !108)
!108 = distinct !DILexicalBlock(scope: !91, file: !1, line: 14, column: 9)
!109 = !DILocation(line: 14, column: 18, scope: !108)
!110 = !DILocation(line: 14, column: 9, scope: !91)
!111 = !DILocation(line: 15, column: 9, scope: !112)
!112 = distinct !DILexicalBlock(scope: !108, file: !1, line: 14, column: 27)
!113 = !DILocation(line: 15, column: 20, scope: !112)
!114 = !DILocation(line: 15, column: 30, scope: !112)
!115 = !DILocation(line: 16, column: 5, scope: !112)
!116 = !DILocation(line: 17, column: 13, scope: !117)
!117 = distinct !DILexicalBlock(scope: !108, file: !1, line: 16, column: 12)
!118 = !DILocalVariable(name: "filePathLen", scope: !117, file: !1, line: 17, type: !14)
!119 = !DILocation(line: 17, column: 34, scope: !117)
!120 = !DILocation(line: 17, column: 27, scope: !117)
!121 = !DILocation(line: 18, column: 47, scope: !117)
!122 = !DILocation(line: 18, column: 59, scope: !117)
!123 = !DILocation(line: 18, column: 46, scope: !117)
!124 = !DILocation(line: 18, column: 39, scope: !117)
!125 = !DILocation(line: 18, column: 9, scope: !117)
!126 = !DILocation(line: 18, column: 20, scope: !117)
!127 = !DILocation(line: 18, column: 30, scope: !117)
!128 = !DILocation(line: 19, column: 16, scope: !117)
!129 = !DILocation(line: 19, column: 27, scope: !117)
!130 = !DILocation(line: 19, column: 38, scope: !117)
!131 = !DILocation(line: 19, column: 9, scope: !117)
!132 = !DILocation(line: 21, column: 37, scope: !91)
!133 = !DILocation(line: 21, column: 5, scope: !91)
!134 = !DILocation(line: 21, column: 16, scope: !91)
!135 = !DILocation(line: 21, column: 35, scope: !91)
!136 = !DILocation(line: 22, column: 5, scope: !91)
!137 = !DILocation(line: 22, column: 16, scope: !91)
!138 = !DILocation(line: 22, column: 24, scope: !91)
!139 = !DILocation(line: 23, column: 9, scope: !140)
!140 = distinct !DILexicalBlock(scope: !91, file: !1, line: 23, column: 9)
!141 = !DILocation(line: 23, column: 19, scope: !140)
!142 = !DILocation(line: 23, column: 9, scope: !91)
!143 = !DILocation(line: 24, column: 9, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !1, line: 23, column: 28)
!145 = !DILocation(line: 24, column: 20, scope: !144)
!146 = !DILocation(line: 24, column: 31, scope: !144)
!147 = !DILocation(line: 25, column: 5, scope: !144)
!148 = !DILocation(line: 25, column: 47, scope: !149)
!149 = !DILexicalBlockFile(scope: !150, file: !1, discriminator: 1)
!150 = distinct !DILexicalBlock(scope: !140, file: !1, line: 25, column: 16)
!151 = !DILocation(line: 25, column: 16, scope: !149)
