; ModuleID = '/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c.opt_debug.bc'
source_filename = "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.CsvParser = type { i8*, i8, i32, i8*, %struct.CsvRow*, %struct._IO_FILE*, i32, i8*, i32 }
%struct.CsvRow = type { i8**, i32 }

@.str = private unnamed_addr constant [74 x i8] c"Cannot supply header, as current CsvParser object does not support header\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Supplied CSV file path is NULL\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"Supplied CSV string is NULL\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"Supplied delimiter is not supported\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.6 = private unnamed_addr constant [44 x i8] c"Error opening CSV file for reading: %s : %s\00", align 1
@.str.7 = private unnamed_addr constant [12 x i8] c"Reached EOF\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{!"clang version 4.0.1 (tags/RELEASE_401/final 336792)"}
!3 = distinct !{!3, !4, !97}
!4 = !DILocation(line: 74, column: 5, scope: !5)
!5 = distinct !DILexicalBlock(scope: !7, file: !6, line: 74, column: 5)
!6 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.c", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!7 = distinct !DISubprogram(name: "CsvParser_destroy_row", scope: !6, file: !6, line: 72, type: !8, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !21, variables: !22)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "CsvRow", file: !12, line: 13, baseType: !13)
!12 = !DIFile(filename: "/home/klee/dockermount/checksum-repair/samples/csv/csvparser.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", file: !12, line: 10, size: 128, elements: !14)
!14 = !{!15, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "fields_", scope: !13, file: !12, line: 11, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "numOfFields_", scope: !13, file: !12, line: 12, baseType: !20, size: 32, offset: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "clang version 4.0.1 (tags/RELEASE_401/final 336792)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !23)
!22 = !{}
!23 = !{!24, !81, !17, !10, !16}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CsvParser", file: !12, line: 25, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CsvParser", file: !12, line: 15, size: 512, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !94, !95, !96}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filePath_", scope: !26, file: !12, line: 16, baseType: !17, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter_", scope: !26, file: !12, line: 17, baseType: !18, size: 8, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "firstLineIsHeader_", scope: !26, file: !12, line: 18, baseType: !20, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "errMsg_", scope: !26, file: !12, line: 19, baseType: !17, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "header_", scope: !26, file: !12, line: 20, baseType: !10, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fileHandler_", scope: !26, file: !12, line: 21, baseType: !34, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 245, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !60, !61, !62, !63, !67, !69, !71, !75, !78, !80, !82, !83, !84, !85, !89, !90}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 246, baseType: !20, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 251, baseType: !17, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 252, baseType: !17, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 253, baseType: !17, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 254, baseType: !17, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 255, baseType: !17, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 256, baseType: !17, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 257, baseType: !17, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 258, baseType: !17, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 260, baseType: !17, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 261, baseType: !17, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 262, baseType: !17, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 264, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 160, size: 192, elements: !55)
!55 = !{!56, !57, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !54, file: !38, line: 161, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !54, file: !38, line: 162, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !54, file: !38, line: 166, baseType: !20, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 266, baseType: !58, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 268, baseType: !20, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 272, baseType: !20, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 274, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 131, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 278, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 279, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 280, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 284, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 154, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 293, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 132, baseType: !66)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !37, file: !38, line: 302, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !37, file: !38, line: 303, baseType: !81, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !37, file: !38, line: 304, baseType: !81, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !37, file: !38, line: 305, baseType: !81, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 306, baseType: !86, size: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 62, baseType: !88)
!87 = !DIFile(filename: "/home/klee/toolchains/llvm+clang-401-x86_64-unknown-linux-gnu/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/klee/dockermount/checksum-repair/samples/csv")
!88 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 308, baseType: !20, size: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 310, baseType: !91, size: 160, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fromString_", scope: !26, file: !12, line: 22, baseType: !20, size: 32, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "csvString_", scope: !26, file: !12, line: 23, baseType: !17, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "csvStringIter_", scope: !26, file: !12, line: 24, baseType: !20, size: 32, offset: 448)
!97 = !DILocation(line: 76, column: 5, scope: !5)
!98 = distinct !{!98, !99, !103}
!99 = !DILocation(line: 147, column: 5, scope: !100)
!100 = distinct !DISubprogram(name: "_CsvParser_getRow", scope: !6, file: !6, line: 106, type: !101, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !21, variables: !22)
!101 = !DISubroutineType(types: !102)
!102 = !{!10, !24}
!103 = !DILocation(line: 209, column: 5, scope: !100)
!104 = distinct !{!104, !105, !109}
!105 = !DILocation(line: 240, column: 5, scope: !106)
!106 = distinct !DISubprogram(name: "read_input", scope: !6, file: !6, line: 236, type: !107, isLocal: false, isDefinition: true, scopeLine: 236, isOptimized: false, unit: !21, variables: !22)
!107 = !DISubroutineType(types: !108)
!108 = !{!17}
!109 = !DILocation(line: 245, column: 5, scope: !106)
!110 = distinct !{!110, !111, !116}
!111 = !DILocation(line: 266, column: 5, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !6, line: 266, column: 5)
!113 = distinct !DISubprogram(name: "main", scope: !6, file: !6, line: 251, type: !114, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !21, variables: !22)
!114 = !DISubroutineType(types: !115)
!115 = !{!20, !20, !16}
!116 = !DILocation(line: 268, column: 5, scope: !112)
!117 = distinct !{!117, !118, !121}
!118 = !DILocation(line: 273, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !120, file: !6, line: 273, column: 9)
!120 = distinct !DILexicalBlock(scope: !113, file: !6, line: 270, column: 50)
!121 = !DILocation(line: 275, column: 9, scope: !119)
!122 = distinct !{!122, !123, !124}
!123 = !DILocation(line: 270, column: 5, scope: !113)
!124 = !DILocation(line: 277, column: 5, scope: !113)
